<details><summary>Digger run report at 2024-01-12 11:29:04 (UTC)</summary>
  <details><summary>Apply for <b>lgogolin/tellent-terraform#default</b></summary>
  
```terraform
Terraform will perform the following actions:

  # google_compute_instance.k3s["lgogolin"] will be created
  + resource "google_compute_instance" "k3s" {
      + can_ip_forward       = false
      + cpu_platform         = (known after apply)
      + current_status       = (known after apply)
      + deletion_protection  = false
      + effective_labels     = (known after apply)
      + guest_accelerator    = (known after apply)
      + id                   = (known after apply)
      + instance_id          = (known after apply)
      + label_fingerprint    = (known after apply)
      + machine_type         = "e2-medium"
      + metadata             = {
          + "ssh-keys" = <<-EOT
                lgogolin:ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIJ/2PvCRaoguHqlS6U2uSSPrS1ks63iLT6xWDfSZ910i lukasz.gogolin@fivetag.pl
            EOT
        }
      + metadata_fingerprint = (known after apply)
      + min_cpu_platform     = (known after apply)
      + name                 = "lgogolin"
      + project              = "cool-software-dev-410716"
      + self_link            = (known after apply)
      + tags_fingerprint     = (known after apply)
      + terraform_labels     = (known after apply)
      + zone                 = "europe-central2-a"

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image                  = "https://www.googleapis.com/compute/v1/projects/cool-software-dev-410716/global/images/k3s-dev"
              + labels                 = (known after apply)
              + provisioned_iops       = (known after apply)
              + provisioned_throughput = (known after apply)
              + size                   = 30
              + type                   = (known after apply)
            }
        }

      + network_interface {
          + internal_ipv6_prefix_length = (known after apply)
          + ipv6_access_type            = (known after apply)
          + ipv6_address                = (known after apply)
          + name                        = (known after apply)
          + network                     = "development"
          + network_ip                  = (known after apply)
          + stack_type                  = (known after apply)
          + subnetwork                  = "public"
          + subnetwork_project          = (known after apply)

          + access_config {
              + nat_ip       = (known after apply)
              + network_tier = (known after apply)
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ vms = {
      + lgogolin = (known after apply)
    }
google_compute_instance.k3s["lgogolin"]: Creating...
google_compute_instance.k3s["lgogolin"]: Still creating... [10s elapsed]
google_compute_instance.k3s["lgogolin"]: Creation complete after 15s [id=projects/cool-software-dev-410716/zones/europe-central2-a/instances/lgogolin]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

Outputs:

vms = {
  "lgogolin" = "34.116.149.243"
}

  ```
</details>
</details>